package com.hlushkov.movieland.data;

import com.github.database.rider.core.api.dataset.DataSetProvider;
import com.github.database.rider.core.dataset.builder.DataSetBuilder;
import org.dbunit.dataset.IDataSet;

public class TestData {
    public static class MovieProvider implements DataSetProvider {

        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.8",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .build();
        }
    }

    public static class MoviesProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("3",
                            "Форрест Гамп",
                            "Forrest Gump",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "200.60",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("4",
                            "Список Шиндлера",
                            "Schindler's List'",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("5",
                            "1+1",
                            "Intouchables",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("6",
                            "Начало",
                            "Inception",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("7",
                            "Жизнь прекрасна",
                            "La vita è bella",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "145.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("8",
                            "Бойцовский клуб",
                            "Fight Club",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.4",
                            "119.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("9",
                            "Звёздные войны: Эпизод 4 – Новая надежда",
                            "Star Wars",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("10",
                            "Звёздные войны: Эпизод 5 – Империя наносит ответный удар",
                            "Star Wars: Episode V - The Empire Strikes Back",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("11",
                            "Унесённые призраками",
                            "Sen to Chihiro no kamikakushi",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "145.90",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("12",
                            "Титаник",
                            "Titanic",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.9",
                            "150.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("13",
                            "Пролетая над гнездом кукушки",
                            "One Flew Over the Cuckoo's Nest",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "180.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("14",
                            "Ходячий замок",
                            "Hauru no ugoku shiro",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "130.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("15",
                            "Гладиатор",
                            "Gladiator",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "175.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("16",
                            "Большой куш",
                            "Snatch.",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "160.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("17",
                            "Темный рыцарь",
                            "The Dark Knight",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "199.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("18",
                            "Как приручить дракона",
                            "How to Train Your Dragon",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "182.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("19",
                            "Молчание ягнят",
                            "The Silence of the Lambs",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("20",
                            "Гран Торино",
                            "Gran Torino",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "100.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("21",
                            "Хороший, плохой, злой",
                            "Il buono, il brutto, il cattivo",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("22",
                            "Укрощение строптивого",
                            "Il bisbetico domato",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.7",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("23",
                            "Блеф",
                            "Bluff storia di truffe e di imbroglioni",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.6",
                            "100.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("24",
                            "Джанго освобожденный",
                            "Django Unchained",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "170.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .values("25",
                            "Танцующий с волками",
                            "Dances with Wolves",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.0",
                            "120.55",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .build();
        }
    }

    public static class GenreProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("genres")
                    .columns("genre_id", "genre_name")
                    .values("1", "драма")
                    .values("2", "криминал")
                    .values("3", "фэнтези")
                    .values("4", "детектив")
                    .values("5", "мелодрама")
                    .values("6", "биография")
                    .values("7", "комедия")
                    .values("8", "фантастика")
                    .values("9", "боевик")
                    .values("10", "триллер")
                    .values("11", "приключения")
                    .values("12", "аниме")
                    .values("13", "мультфильм")
                    .values("14", "семейный")
                    .values("15", "вестерн")
                    .build();
        }
    }

    public static class MoviesByGenresProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.8",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("3",
                            "Форрест Гамп",
                            "Forrest Gump",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("4",
                            "Список Шиндлера",
                            "Schindler's List'",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .table("genres")
                    .columns("genre_id", "genre_name")
                    .values("1", "драма")
                    .values("2", "криминал")
                    .values("3", "фэнтези")
                    .values("4", "детектив")
                    .values("5", "мелодрама")
                    .values("6", "биография")
                    .table("movies_genres")
                    .columns("movie_id", "genre_id")
                    .values("1", "1").values("1", "2")
                    .values("2", "1").values("2", "2").values("2", "3").values("2", "4")
                    .values("3", "1").values("3", "5")
                    .values("4", "1").values("4", "6")
                    .build();
        }
    }

    public static class MoviesGenresFullProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("3",
                            "Форрест Гамп",
                            "Forrest Gump",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "200.60",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("4",
                            "Список Шиндлера",
                            "Schindler's List'",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("5",
                            "1+1",
                            "Intouchables",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("6",
                            "Начало",
                            "Inception",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("7",
                            "Жизнь прекрасна",
                            "La vita è bella",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "145.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("8",
                            "Бойцовский клуб",
                            "Fight Club",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.4",
                            "119.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("9",
                            "Звёздные войны: Эпизод 4 – Новая надежда",
                            "Star Wars",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("10",
                            "Звёздные войны: Эпизод 5 – Империя наносит ответный удар",
                            "Star Wars: Episode V - The Empire Strikes Back",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("11",
                            "Унесённые призраками",
                            "Sen to Chihiro no kamikakushi",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "145.90",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("12",
                            "Титаник",
                            "Titanic",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.9",
                            "150.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("13",
                            "Пролетая над гнездом кукушки",
                            "One Flew Over the Cuckoo's Nest",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "180.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("14",
                            "Ходячий замок",
                            "Hauru no ugoku shiro",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "130.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("15",
                            "Гладиатор",
                            "Gladiator",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "175.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("16",
                            "Большой куш",
                            "Snatch.",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "160.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("17",
                            "Темный рыцарь",
                            "The Dark Knight",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "199.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("18",
                            "Как приручить дракона",
                            "How to Train Your Dragon",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "182.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("19",
                            "Молчание ягнят",
                            "The Silence of the Lambs",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("20",
                            "Гран Торино",
                            "Gran Torino",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "100.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("21",
                            "Хороший, плохой, злой",
                            "Il buono, il brutto, il cattivo",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("22",
                            "Укрощение строптивого",
                            "Il bisbetico domato",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.7",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("23",
                            "Блеф",
                            "Bluff storia di truffe e di imbroglioni",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.6",
                            "100.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("24",
                            "Джанго освобожденный",
                            "Django Unchained",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "170.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .values("25",
                            "Танцующий с волками",
                            "Dances with Wolves",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.0",
                            "120.55",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")


                    .table("genres")
                    .columns("genre_id", "genre_name")
                    .values("1", "драма")
                    .values("2", "криминал")
                    .values("3", "фэнтези")
                    .values("4", "детектив")
                    .values("5", "мелодрама")
                    .values("6", "биография")
                    .values("7", "комедия")
                    .values("8", "фантастика")
                    .values("9", "боевик")
                    .values("10", "триллер")
                    .values("11", "приключения")
                    .values("12", "аниме")
                    .values("13", "мультфильм")
                    .values("14", "семейный")
                    .values("15", "вестерн")

                    .table("movies_genres")
                    .columns("movie_id", "genre_id")
                    .values("1", "1").values("1", "2")
                    .values("2", "1").values("2", "2").values("2", "3").values("2", "4")
                    .values("3", "1").values("3", "5")
                    .values("4", "1").values("4", "6")
                    .values("5", "1").values("5", "6").values("5", "7")
                    .values("6", "1").values("6", "4").values("6", "8").values("6", "9").values("6", "10")
                    .values("7", "1").values("7", "5").values("7", "7")
                    .values("8", "1").values("8", "2").values("8", "10")
                    .values("9", "3").values("9", "8").values("9", "9").values("9", "11")
                    .values("10", "3").values("10", "8").values("10", "9").values("10", "11")
                    .values("11", "3").values("11", "11").values("11", "12").values("11", "13").values("11", "14")
                    .values("12", "1").values("12", "5")
                    .values("13", "1")
                    .values("14", "3").values("14", "11").values("14", "12").values("14", "13")
                    .values("15", "1").values("15", "9")
                    .values("16", "2").values("16", "7")
                    .values("17", "1").values("17", "2").values("17", "8").values("17", "9").values("17", "10")
                    .values("18", "3").values("18", "7").values("18", "11").values("18", "13").values("18", "14")
                    .values("19", "1").values("19", "12").values("19", "4").values("19", "10")
                    .values("20", "1")
                    .values("21", "15")
                    .values("22", "7")
                    .values("23", "2").values("23", "7")
                    .values("24", "1").values("24", "7").values("24", "11").values("24", "15")
                    .values("25", "1").values("25", "11").values("25", "15")
                    .build();
        }
    }

    public static class MoviesCountriesGenresReviewsUsers implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("3",
                            "Форрест Гамп",
                            "Forrest Gump",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "200.60",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("4",
                            "Список Шиндлера",
                            "Schindler's List'",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("5",
                            "1+1",
                            "Intouchables",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("6",
                            "Начало",
                            "Inception",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("7",
                            "Жизнь прекрасна",
                            "La vita è bella",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "145.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("8",
                            "Бойцовский клуб",
                            "Fight Club",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.4",
                            "119.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("9",
                            "Звёздные войны: Эпизод 4 – Новая надежда",
                            "Star Wars",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("10",
                            "Звёздные войны: Эпизод 5 – Империя наносит ответный удар",
                            "Star Wars: Episode V - The Empire Strikes Back",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("11",
                            "Унесённые призраками",
                            "Sen to Chihiro no kamikakushi",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "145.90",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("12",
                            "Титаник",
                            "Titanic",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.9",
                            "150.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("13",
                            "Пролетая над гнездом кукушки",
                            "One Flew Over the Cuckoo's Nest",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "180.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("14",
                            "Ходячий замок",
                            "Hauru no ugoku shiro",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "130.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("15",
                            "Гладиатор",
                            "Gladiator",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "175.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("16",
                            "Большой куш",
                            "Snatch.",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "160.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("17",
                            "Темный рыцарь",
                            "The Dark Knight",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "199.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("18",
                            "Как приручить дракона",
                            "How to Train Your Dragon",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "182.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("19",
                            "Молчание ягнят",
                            "The Silence of the Lambs",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("20",
                            "Гран Торино",
                            "Gran Torino",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "100.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("21",
                            "Хороший, плохой, злой",
                            "Il buono, il brutto, il cattivo",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("22",
                            "Укрощение строптивого",
                            "Il bisbetico domato",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.7",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("23",
                            "Блеф",
                            "Bluff storia di truffe e di imbroglioni",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.6",
                            "100.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("24",
                            "Джанго освобожденный",
                            "Django Unchained",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "170.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .values("25",
                            "Танцующий с волками",
                            "Dances with Wolves",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.0",
                            "120.55",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")


                    .table("genres")
                    .columns("genre_id", "genre_name")
                    .values("1", "драма")
                    .values("2", "криминал")
                    .values("3", "фэнтези")
                    .values("4", "детектив")
                    .values("5", "мелодрама")
                    .values("6", "биография")
                    .values("7", "комедия")
                    .values("8", "фантастика")
                    .values("9", "боевик")
                    .values("10", "триллер")
                    .values("11", "приключения")
                    .values("12", "аниме")
                    .values("13", "мультфильм")
                    .values("14", "семейный")
                    .values("15", "вестерн")

                    .table("movies_genres")
                    .columns("movie_id", "genre_id")
                    .values("1", "1").values("1", "2")
                    .values("2", "1").values("2", "2").values("2", "3").values("2", "4")
                    .values("3", "1").values("3", "5")
                    .values("4", "1").values("4", "6")
                    .values("5", "1").values("5", "6").values("5", "7")
                    .values("6", "1").values("6", "4").values("6", "8").values("6", "9").values("6", "10")
                    .values("7", "1").values("7", "5").values("7", "7")
                    .values("8", "1").values("8", "2").values("8", "10")
                    .values("9", "3").values("9", "8").values("9", "9").values("9", "11")
                    .values("10", "3").values("10", "8").values("10", "9").values("10", "11")
                    .values("11", "3").values("11", "11").values("11", "12").values("11", "13").values("11", "14")
                    .values("12", "1").values("12", "5")
                    .values("13", "1")
                    .values("14", "3").values("14", "11").values("14", "12").values("14", "13")
                    .values("15", "1").values("15", "9")
                    .values("16", "2").values("16", "7")
                    .values("17", "1").values("17", "2").values("17", "8").values("17", "9").values("17", "10")
                    .values("18", "3").values("18", "7").values("18", "11").values("18", "13").values("18", "14")
                    .values("19", "1").values("19", "12").values("19", "4").values("19", "10")
                    .values("20", "1")
                    .values("21", "15")
                    .values("22", "7")
                    .values("23", "2").values("23", "7")
                    .values("24", "1").values("24", "7").values("24", "11").values("24", "15")
                    .values("25", "1").values("25", "11").values("25", "15")

                    .table("countries")
                    .columns("country_id", "country_name")
                    .values("1", "США")
                    .values("2", "Франция")
                    .values("3", "Великобритания")
                    .values("4", "Италия")
                    .values("5", "Германия")
                    .values("6", "Япония")
                    .values("7", "Испания")

                    .table("movies_countries")
                    .columns("movie_id", "country_id")
                    .values("1", "1")
                    .values("2", "1")
                    .values("3", "1")
                    .values("4", "1")
                    .values("5", "2")
                    .values("6", "1")
                    .values("6", "3")
                    .values("7", "4")
                    .values("8", "1")
                    .values("8", "5")
                    .values("9", "1")
                    .values("10", "1")
                    .values("11", "6")
                    .values("12", "1")
                    .values("13", "1")
                    .values("14", "6")
                    .values("15", "1")
                    .values("15", "3")
                    .values("16", "1")
                    .values("17", "1")
                    .values("17", "3")
                    .values("18", "1")
                    .values("19", "1")
                    .values("20", "1")
                    .values("21", "1")
                    .values("21", "4")
                    .values("21", "5")
                    .values("21", "7")
                    .values("22", "4")
                    .values("23", "4")
                    .values("24", "1")
                    .values("25", "1")
                    .values("25", "3")

                    .table("users")
                    .columns("user_id", "user_nickname", "user_email", "user_password", "user_salt", "user_role")
                    .values("1", "Рональд Рейнольдс", "ronald.reynolds66@example.com", "paco", "salt1", "user")
                    .values("2", "Дарлин Эдвардс", "darlene.edwards15@example.com", "bricks", "salt2", "user")
                    .values("3", "Габриэль Джексон", "gabriel.jackson91@example.com", "hjkl", "salt3", "user")

                    .table("reviews")
                    .columns("review_id", "movie_id", "user_id", "review_text")
                    .values("1", "1", "2", "Гениальное кино! Смотришь и думаешь «Так не бывает!», но позже понимаешь, то " +
                            "только так и должно быть. Начинаешь заново осмысливать значение фразы, которую постоянно " +
                            "используешь в своей жизни, «Надежда умирает последней». Ведь если ты не надеешься, то все " +
                            "в твоей жизни гаснет, не остается смысла. Фильм наполнен бесконечным числом правильных " +
                            "афоризмов. Я уверена, что буду пересматривать его сотни раз.")

                    .values("2", "1", "3",
                            "Кино это является, безусловно, «со знаком качества». Что же до первого места в рейтинге, " +
                                    "то, думаю, здесь имело место быть выставление «десяточек» от большинства зрителей " +
                                    "вкупе с раздутыми восторженными откликами кинокритиков. 'Фильм атмосферный. " +
                                    "Он драматичный. И, конечно, заслуживает того, чтобы находиться довольно высоко " +
                                    "в мировом кинематографе.")
                    .build();
        }
    }

    public static class UserProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("users")
                    .columns("user_id", "user_nickname", "user_email", "user_password", "user_salt", "user_role")
                    .values("1", "user", "user@gmail.com", "e172c5654dbc12d78ce1850a4f7956ba6e5a3d2ac40f0925fc6d691ebb54f6bf", "user", "user")
                    .build();
        }
    }

    public static class UserAdminProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("users")
                    .columns("user_id", "user_nickname", "user_email", "user_password", "user_salt", "user_role")
                    .values("1", "admin", "admin@gmail.com", "d82494f05d6917ba02f7aaa29689ccb444bb73f20380876cb05d1f37537b7892", "admin", "admin")
                    .build();
        }
    }

    public static class ReviewsProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.8",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .table("users")
                    .columns("user_id", "user_nickname", "user_email", "user_password", "user_salt", "user_role")
                    .values("1", "user", "user@gmail.com", "e172c5654dbc12d78ce1850a4f7956ba6e5a3d2ac40f0925fc6d691ebb54f6bf", "user", "user")
                    .values("2", "Дарлин Эдвардс", "darlene.edwards15@example.com", "bricks", "salt2", "user")
                    .values("3", "Габриэль Джексон", "gabriel.jackson91@example.com", "hjkl", "salt3", "user")

                    .table("reviews")
                    .columns("review_id", "movie_id", "user_id", "review_text")
                    .values("1", "1", "2", "Гениальное кино! Смотришь и думаешь «Так не бывает!», но позже понимаешь, то " +
                            "только так и должно быть. Начинаешь заново осмысливать значение фразы, которую постоянно " +
                            "используешь в своей жизни, «Надежда умирает последней». Ведь если ты не надеешься, то все " +
                            "в твоей жизни гаснет, не остается смысла. Фильм наполнен бесконечным числом правильных " +
                            "афоризмов. Я уверена, что буду пересматривать его сотни раз.")

                    .values("2", "1", "3",
                            "Кино это является, безусловно, «со знаком качества». Что же до первого места в рейтинге, " +
                                    "то, думаю, здесь имело место быть выставление «десяточек» от большинства зрителей " +
                                    "вкупе с раздутыми восторженными откликами кинокритиков. 'Фильм атмосферный. " +
                                    "Он драматичный. И, конечно, заслуживает того, чтобы находиться довольно высоко " +
                                    "в мировом кинематографе.")
                    .build();
        }
    }

    public static class ResultReviewsProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.8",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .table("users")
                    .columns("user_id", "user_nickname", "user_email", "user_password", "user_salt", "user_role")
                    .values("1", "user", "user@gmail.com", "e172c5654dbc12d78ce1850a4f7956ba6e5a3d2ac40f0925fc6d691ebb54f6bf", "user", "user")
                    .values("2", "Дарлин Эдвардс", "darlene.edwards15@example.com", "bricks", "salt2", "user")
                    .values("3", "Габриэль Джексон", "gabriel.jackson91@example.com", "hjkl", "salt3", "user")

                    .table("reviews")
                    .columns("review_id", "movie_id", "user_id", "review_text")
                    .values("1", "1", "2", "Гениальное кино! Смотришь и думаешь «Так не бывает!», но позже понимаешь, то " +
                            "только так и должно быть. Начинаешь заново осмысливать значение фразы, которую постоянно " +
                            "используешь в своей жизни, «Надежда умирает последней». Ведь если ты не надеешься, то все " +
                            "в твоей жизни гаснет, не остается смысла. Фильм наполнен бесконечным числом правильных " +
                            "афоризмов. Я уверена, что буду пересматривать его сотни раз.")

                    .values("2", "1", "3",
                            "Кино это является, безусловно, «со знаком качества». Что же до первого места в рейтинге, " +
                                    "то, думаю, здесь имело место быть выставление «десяточек» от большинства зрителей " +
                                    "вкупе с раздутыми восторженными откликами кинокритиков. 'Фильм атмосферный. " +
                                    "Он драматичный. И, конечно, заслуживает того, чтобы находиться довольно высоко " +
                                    "в мировом кинематографе.")
                    .values("3", "1", "1", "Nice film!")
                    .build();
        }
    }

    public static class AddMovieResultProvider implements DataSetProvider {
        @Override
        public IDataSet provide() {
            return new DataSetBuilder()
                    .table("movies")
                    .columns("movie_id", "movie_name_russian", "movie_name_native", "movie_year_of_release", "movie_description", "movie_rating", "movie_price", "movie_picture_path")
                    .values("1",
                            "Побег из Шоушенка",
                            "The Shawshank Redemption",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("2",
                            "Зеленая миля",
                            "The Green Mile",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.9",
                            "134.67",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("3",
                            "Форрест Гамп",
                            "Forrest Gump",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "200.60",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("4",
                            "Список Шиндлера",
                            "Schindler's List'",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("5",
                            "1+1",
                            "Intouchables",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("6",
                            "Начало",
                            "Inception",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("7",
                            "Жизнь прекрасна",
                            "La vita è bella",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "145.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("8",
                            "Бойцовский клуб",
                            "Fight Club",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.4",
                            "119.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("9",
                            "Звёздные войны: Эпизод 4 – Новая надежда",
                            "Star Wars",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("10",
                            "Звёздные войны: Эпизод 5 – Империя наносит ответный удар",
                            "Star Wars: Episode V - The Empire Strikes Back",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "198.98",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("11",
                            "Унесённые призраками",
                            "Sen to Chihiro no kamikakushi",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "145.90",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("12",
                            "Титаник",
                            "Titanic",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.9",
                            "150.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("13",
                            "Пролетая над гнездом кукушки",
                            "One Flew Over the Cuckoo's Nest",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.7",
                            "180.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("14",
                            "Ходячий замок",
                            "Hauru no ugoku shiro",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "130.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("15",
                            "Гладиатор",
                            "Gladiator",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.6",
                            "175.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("16",
                            "Большой куш",
                            "Snatch.",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "160.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("17",
                            "Темный рыцарь",
                            "The Dark Knight",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "199.99",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("18",
                            "Как приручить дракона",
                            "How to Train Your Dragon",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.2",
                            "182.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("19",
                            "Молчание ягнят",
                            "The Silence of the Lambs",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.3",
                            "150.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("20",
                            "Гран Торино",
                            "Gran Torino",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.1",
                            "100.50",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("21",
                            "Хороший, плохой, злой",
                            "Il buono, il brutto, il cattivo",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "130.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("22",
                            "Укрощение строптивого",
                            "Il bisbetico domato",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.7",
                            "120.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("23",
                            "Блеф",
                            "Bluff storia di truffe e di imbroglioni",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "7.6",
                            "100.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("24",
                            "Джанго освобожденный",
                            "Django Unchained",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись в тюрьме под названием Шоушенк, " +
                                    "он сталкивается с жестокостью и беззаконием, царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится их " +
                                    "рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, отказывается мириться с приговором судьбы и начинает " +
                                    "разрабатывать невероятно дерзкий план своего освобождения.",
                            "8.5",
                            "170.00",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .values("25",
                            "Танцующий с волками",
                            "Dances with Wolves",
                            "1999",
                            "Обвиненный в страшном преступлении, Джон Коффи оказывается в блоке смертников тюрьмы «Холодная гора». Вновь прибывший" +
                                    " обладал поразительным ростом и был пугающе спокоен, что, впрочем, никак не влияло на отношение к нему начальника блока" +
                                    " Пола Эджкомба, привыкшего исполнять приговор.",
                            "8.0",
                            "120.55",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")
                    .values("26",
                            "Побег из тюрьмы Шоушенка",
                            "The Shawshank Redemption prison",
                            "1994",
                            "Успешный банкир Энди Дюфрейн обвинен в убийстве собственной жены и ее любовника. Оказавшись" +
                                    " в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, " +
                                    "царящими по обе стороны решетки. Каждый, кто попадает в эти стены, становится " +
                                    "их рабом до конца жизни. Но Энди, вооруженный живым умом и доброй душой, " +
                                    "отказывается мириться с приговором судьбы и начинает разрабатывать невероятно " +
                                    "дерзкий план своего освобождения.",
                            "8.0",
                            "123.45",
                            "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1._SY209_CR0,0,140,209_.jpg")

                    .table("genres")
                    .columns("genre_id", "genre_name")
                    .values("1", "драма")
                    .values("2", "криминал")
                    .values("3", "фэнтези")
                    .values("4", "детектив")
                    .values("5", "мелодрама")
                    .values("6", "биография")
                    .values("7", "комедия")
                    .values("8", "фантастика")
                    .values("9", "боевик")
                    .values("10", "триллер")
                    .values("11", "приключения")
                    .values("12", "аниме")
                    .values("13", "мультфильм")
                    .values("14", "семейный")
                    .values("15", "вестерн")

                    .table("movies_genres")
                    .columns("movie_id", "genre_id")
                    .values("1", "1").values("1", "2")
                    .values("2", "1").values("2", "2").values("2", "3").values("2", "4")
                    .values("3", "1").values("3", "5")
                    .values("4", "1").values("4", "6")
                    .values("5", "1").values("5", "6").values("5", "7")
                    .values("6", "1").values("6", "4").values("6", "8").values("6", "9").values("6", "10")
                    .values("7", "1").values("7", "5").values("7", "7")
                    .values("8", "1").values("8", "2").values("8", "10")
                    .values("9", "3").values("9", "8").values("9", "9").values("9", "11")
                    .values("10", "3").values("10", "8").values("10", "9").values("10", "11")
                    .values("11", "3").values("11", "11").values("11", "12").values("11", "13").values("11", "14")
                    .values("12", "1").values("12", "5")
                    .values("13", "1")
                    .values("14", "3").values("14", "11").values("14", "12").values("14", "13")
                    .values("15", "1").values("15", "9")
                    .values("16", "2").values("16", "7")
                    .values("17", "1").values("17", "2").values("17", "8").values("17", "9").values("17", "10")
                    .values("18", "3").values("18", "7").values("18", "11").values("18", "13").values("18", "14")
                    .values("19", "1").values("19", "12").values("19", "4").values("19", "10")
                    .values("20", "1")
                    .values("21", "15")
                    .values("22", "7")
                    .values("23", "2").values("23", "7")
                    .values("24", "1").values("24", "7").values("24", "11").values("24", "15")
                    .values("25", "1").values("25", "11").values("25", "15")
                    .values("26", "1").values("26", "2").values("26", "3")

                    .table("countries")
                    .columns("country_id", "country_name")
                    .values("1", "США")
                    .values("2", "Франция")
                    .values("3", "Великобритания")
                    .values("4", "Италия")
                    .values("5", "Германия")
                    .values("6", "Япония")
                    .values("7", "Испания")

                    .table("movies_countries")
                    .columns("movie_id", "country_id")
                    .values("1", "1")
                    .values("2", "1")
                    .values("3", "1")
                    .values("4", "1")
                    .values("5", "2")
                    .values("6", "1")
                    .values("6", "3")
                    .values("7", "4")
                    .values("8", "1")
                    .values("8", "5")
                    .values("9", "1")
                    .values("10", "1")
                    .values("11", "6")
                    .values("12", "1")
                    .values("13", "1")
                    .values("14", "6")
                    .values("15", "1")
                    .values("15", "3")
                    .values("16", "1")
                    .values("17", "1")
                    .values("17", "3")
                    .values("18", "1")
                    .values("19", "1")
                    .values("20", "1")
                    .values("21", "1")
                    .values("21", "4")
                    .values("21", "5")
                    .values("21", "7")
                    .values("22", "4")
                    .values("23", "4")
                    .values("24", "1")
                    .values("25", "1")
                    .values("25", "3")
                    .values("26", "1")
                    .values("26", "2")

                    .table("users")
                    .columns("user_id", "user_nickname", "user_email", "user_password", "user_salt", "user_role")
                    .values("1", "Рональд Рейнольдс", "ronald.reynolds66@example.com", "paco", "salt1", "user")
                    .values("2", "Дарлин Эдвардс", "darlene.edwards15@example.com", "bricks", "salt2", "user")
                    .values("3", "Габриэль Джексон", "gabriel.jackson91@example.com", "hjkl", "salt3", "user")

                    .table("reviews")
                    .columns("review_id", "movie_id", "user_id", "review_text")
                    .values("1", "1", "2", "Гениальное кино! Смотришь и думаешь «Так не бывает!», но позже понимаешь, то " +
                            "только так и должно быть. Начинаешь заново осмысливать значение фразы, которую постоянно " +
                            "используешь в своей жизни, «Надежда умирает последней». Ведь если ты не надеешься, то все " +
                            "в твоей жизни гаснет, не остается смысла. Фильм наполнен бесконечным числом правильных " +
                            "афоризмов. Я уверена, что буду пересматривать его сотни раз.")

                    .values("2", "1", "3",
                            "Кино это является, безусловно, «со знаком качества». Что же до первого места в рейтинге, " +
                                    "то, думаю, здесь имело место быть выставление «десяточек» от большинства зрителей " +
                                    "вкупе с раздутыми восторженными откликами кинокритиков. 'Фильм атмосферный. " +
                                    "Он драматичный. И, конечно, заслуживает того, чтобы находиться довольно высоко " +
                                    "в мировом кинематографе.")
                    .build();
        }
    }
}




